IdeaRS.OpenModel.CrossSection.Stirrup
Stirrup

IdeaRS.OpenModel.CrossSection.Stirrup.Geometry
Geometry

IdeaRS.OpenModel.CrossSection.Stirrup.Diameter
Diameter

IdeaRS.OpenModel.CrossSection.Stirrup.Material
Material

IdeaRS.OpenModel.CrossSection.Stirrup.AnchorageLenght
Anchorage Lenght

IdeaRS.OpenModel.CrossSection.Stirrup.DiameterOfMandrel
Radius of stirrup mandrel - refering to stirrup axis

IdeaRS.OpenModel.CrossSection.Stirrup.IsClosed
Open / Closed stirrup

IdeaRS.OpenModel.CrossSection.Stirrup.Distance
Longitudinal distance between stirrups